       IDENTIFICATION DIVISION.
           PROGRAM-ID. PROGRAMA-05.
      ******************************
      * OPERADORES ARITIMETICOS
      ******************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 WS-VALOR1 PIC S9(2) VALUE ZEROS.
           77 WS-VALOR2 PIC S9(2) VALUE ZEROS.
           77 WS-RESULT PIC S9(4) VALUE ZEROS.
      *"S" PARA SINALIZAR O SINAL NO VALOR
           77 WS-REMAINDER PIC S9(4) VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WS-VALOR1 FROM CONSOLE.
           ACCEPT WS-VALOR2 FROM CONSOLE.
           DISPLAY "==================================".
           DISPLAY "NUMERO 1: " WS-VALOR1.
           DISPLAY "NUMERO 2: " WS-VALOR2.
           DISPLAY "==================================".
      ****************COMPUTE*******************
           COMPUTE WS-RESULT = (WS-VALOR1 + WS-VALOR2)/2.
           DISPLAY "COMPUTE A+B/2 : " WS-RESULT.

      * INITIALISE -> RESETA O VALOR DA VARIAVEL PARA ZERO
           INITIALISE WS-RESULT.
      * OPERACAO ADD -> RES = RES + (A + B)
           ADD WS-VALOR1 WS-VALOR2 TO WS-RESULT.
           DISPLAY "SOMA: " WS-RESULT.

      * INITIALISE -> RESETA O VALOR DA VARIAVEL PARA ZERO
           INITIALISE WS-RESULT.
      * OPERACAO SUBTRACT -> RES = RES - (A + B)
           SUBTRACT WS-VALOR1 WS-VALOR2 FROM WS-RESULT.
           DISPLAY "SUBTRACAO SEM O GIVING: " WS-RESULT.

      * INITIALISE -> RESETA O VALOR DA VARIAVEL PARA ZERO
           INITIALISE WS-RESULT.
      * OPERACAO SUBTRACT -> RES = B - A
           SUBTRACT WS-VALOR1 FROM WS-VALOR2 GIVING WS-RESULT.
           DISPLAY "SUBTRACT COM O GIVING: " WS-RESULT.

      * INITIALISE -> RESETA O VALOR DA VARIAVEL PARA ZERO
           INITIALISE WS-RESULT.
      * OPERACAO DIVIDE -> RES = A/B
           DIVIDE WS-VALOR1 BY WS-VALOR2 GIVING WS-RESULT REMAINDER
     -         WS-REMAINDER.
           DISPLAY "DIVIDE COM BY: " WS-RESULT " E " WS-REMAINDER.

      * INITIALISE -> RESETA O VALOR DA VARIAVEL PARA ZERO
           INITIALISE WS-RESULT.
      * OPERACAO DIVIDE -> RES = B/A
           DIVIDE WS-VALOR1 INTO WS-VALOR2 GIVING WS-RESULT REMAINDER
     -         WS-REMAINDER.
           DISPLAY "DIVIDE COM INTO: " WS-RESULT " E " WS-REMAINDER.

      * INITIALISE -> RESETA O VALOR DA VARIAVEL PARA ZERO
           INITIALISE WS-RESULT.
      * OPERACAO MULTIPLY -> RES = A * B
           MULTIPLY WS-VALOR1 BY WS-VALOR2 GIVING WS-RESULT.
           DISPLAY "MULTIPLY COM BY: " WS-RESULT.

      * INITIALISE -> RESETA O VALOR DA VARIAVEL PARA ZERO
           MOVE 1 TO WS-RESULT.
      * OPERACAO SUBTRACT -> B = A * B | C = A * C
           MULTIPLY WS-VALOR1 BY WS-VALOR2 WS-RESULT.
           DISPLAY "MULTIPLY DISTRIBUIDO: " WS-RESULT " E " WS-VALOR2.

           STOP RUN.
       END PROGRAM PROGRAMA-05.
