
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG03.
      *****************************************
      * AREA DE COMENTARIOS
      * PROGRAMA DE IMPRIMIR A DATA DO SISTEMA
      * UTILIZAR VARIAVEIS DE NIVEL 01,02... (ESTRUTURADA)
      *****************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *VARIAVEIS ESTRUTURADAS (PAIS) PODEM CONTAR ATEH A VARIAVEL 49
      *ELAS NAO PRECISAM SEGUIR ORDEM NUMERICA SEQUENCIAL DE +1
       01 WRK-DATA.
           02 WRK-ANO PIC 9(4) VALUE ZEROS.
           02 WRK-MES PIC 9(2) VALUE ZEROS.
           02 WRK-DIA PIC 9(2) VALUE ZEROS.
      *COBOL GRAVA NO FORMATO AMERICANO AAAA/MM/ADD
      *VARIAVEL ESTRUTURADA FACILITA NA ATRIBUICAO
       PROCEDURE DIVISION.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           DISPLAY "DATA: " WRK-DIA "/" WRK-MES "/" WRK-ANO.
           STOP RUN.
       END PROGRAM PROG03.
