       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG01.
      *****************************************
      * AREA DE COMENTARIOS
      * PROGRAMA DE HELLO WORLD
      *****************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY "HELLO WORLD".
           STOP RUN.
       END PROGRAM PROG01.
