       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG04.
      *****************************************
      * AREA DE COMENTARIOS
      * RECEBER NOME E SALARIO
      * IMPRIMIR FORMATADO - USO DA VIRGULA
      * USANDO UMA MASCARA
      *****************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 WRK-NOME PIC A(20) VALUES SPACES.
           77 WRK-SALARIO PIC 9(6)V99 VALUES ZEROS.
      *PARA NUMEROS COM VIRGULA COLOCAR O "V" COM O NUMERO DE CASAS
           77 WRK-SALARIO-ED PIC $ZZZ.ZZ9,99 VALUES ZEROS.
      *O PIC "Z" DEFINE UMA MASCARA PARA QUANDO O VALOR FOR NULL NAO
      *PRINTE OS ZEROS
       PROCEDURE DIVISION.
           ACCEPT WRK-NOME FROM CONSOLE.
           ACCEPT WRK-SALARIO FROM CONSOLE.
      ******************MOSTRAR DADOS******************
           DISPLAY WRK-NOME.
           MOVE WRK-SALARIO TO WRK-SALARIO-ED.
           DISPLAY "SALARIO: " WRK-SALARIO-ED.
           STOP RUN.
       END PROGRAM PROG04.
