       IDENTIFICATION DIVISION.
           PROGRAM-ID. PROGRAMA-06.
      ******************************
      * SINAIS POSITIVOS E NEGATIVOS
      ******************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 WS-VALOR1 PIC S9(2) VALUE ZEROS.
           77 WS-VALOR2 PIC S9(2) VALUE ZEROS.
           77 WS-RESULT PIC -ZZZ9 VALUE ZEROS.
      *"S" PARA SINALIZAR O SINAL NO VALOR
       PROCEDURE DIVISION.
       ACCEPT WS-VALOR1 FROM CONSOLE.
       ACCEPT WS-VALOR2 FROM CONSOLE.
      * OPERACAO SUBTRACT -> RES = B - A
           SUBTRACT WS-VALOR1 FROM WS-VALOR2 GIVING WS-RESULT.
           DISPLAY "SUBTRACT COM O GIVING: " WS-RESULT.

           STOP RUN.
       END PROGRAM PROGRAMA-06.
