       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-10.
      ***************************
      * OPERADORES RLACIONAIS
      ***************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 WS-LARGURA PIC 9(3)V99 VALUES ZEROS.
           77 WS-COMPRIMENTO PIC 9(3)V99 VALUES ZEROS.
           77 WS-AREA PIC Z(9)9,99 VALUES ZEROS.
       PROCEDURE DIVISION.
           DISPLAY "DIGITE A ALTURA".
           ACCEPT WS-LARGURA.

           DISPLAY "DIGITE O COMPRIMENTO".
           ACCEPT WS-COMPRIMENTO.

           IF WS-COMPRIMENTO > 0 AND WS-LARGURA >0 THEN
               COMPUTE WS-AREA = WS-COMPRIMENTO*WS-LARGURA
               DISPLAY "AREA =" WS-AREA
           ELSE
               DISPLAY "NENHUM DOS VALORES PODE SER ZERO"
           END-IF.

           STOP RUN.
       END PROGRAM PROGRAM-10.
