       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG11.
      *****************************************
      * PARAGRAFOS E LOGICA ESTRUTURADA
      *****************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 WS-LARGURA PIC 9(3)V99 VALUES ZEROS.
           77 WS-COMPRIMENTO PIC 9(3)V99 VALUES ZEROS.
           77 WS-AREA PIC Z(9)9,99 VALUES ZEROS.
       PROCEDURE DIVISION.
       0001-PRINCIPAL.
      *PARAGRAFOS, LOGICA DE CONTER TODO O PROGRAMA
           PERFORM 0100-INICIALIZAR.
           PERFORM 0200-PROCESSAR THRU 0200-PROCESSAR-FIM.
           PERFORM 0300-FINALIZAR.
           STOP RUN.

       0100-INICIALIZAR.
           DISPLAY "DIGITE A ALTURA".
           ACCEPT WS-LARGURA.

           DISPLAY "DIGITE O COMPRIMENTO".
           ACCEPT WS-COMPRIMENTO.

       0200-PROCESSAR.
            IF WS-COMPRIMENTO > 0 AND WS-LARGURA >0 THEN
               COMPUTE WS-AREA = WS-COMPRIMENTO*WS-LARGURA
               DISPLAY "AREA =" WS-AREA
           ELSE
               DISPLAY "NENHUM DOS VALORES PODE SER ZERO"
           END-IF.
       0200-PROCESSAR-FIM.
       0300-FINALIZAR.
           DISPLAY "FINAL DE PROCESSAMENTO/FECHAMENTO DE ARQUIVOS".
       END PROGRAM PROG11.
