       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJETO4.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES.
               DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 WS-VALOR-INICIAL PIC 9(6)V9(2) VALUES ZEROS.
           77 WS-MESES PIC 9(2) VALUES ZEROS.
           77 WS-TAXA PIC 9(2)V9(2) VALUES ZEROS.
       PROCEDURE DIVISION.

       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
           PERFORM 0200-PROCESSAR WS-MESES TIMES.
           PERFORM 0300-FINALIZAR.

           STOP RUN.

       0100-INICIALIZAR.
           DISPLAY "DIGITE O VALOR INICIAL DO INVESTIMENTO".
           ACCEPT WS-VALOR-INICIAL.

           DISPLAY "DIGITE O NUMERO DE MESES".
           ACCEPT WS-MESES.

           DISPLAY "DIGITE COEFICIENTE DE TAXA %".
           ACCEPT WS-TAXA.

       0200-PROCESSAR.
           COMPUTE WS-VALOR-INICIAL = WS-VALOR-INICIAL *
             (1 + WS-TAXA*0,01).
       0300-FINALIZAR.
           DISPLAY "O VALOR EH DE: " WS-VALOR-INICIAL.
